; ModuleID = 'optimized.ll'
source_filename = "21hiitqy3r04wa0jt865224b9"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

!llvm.module.flags = !{!0, !1, !2, !3, !4}
!llvm.ident = !{!5}
!llvm.dbg.cu = !{!6}

!0 = !{i32 8, !"PIC Level", i32 2}
!1 = !{i32 7, !"PIE Level", i32 2}
!2 = !{i32 2, !"RtLibUseGOT", i32 1}
!3 = !{i32 2, !"Dwarf Version", i32 4}
!4 = !{i32 2, !"Debug Info Version", i32 3}
!5 = !{!"rustc version 1.80.0-nightly (ab14f944a 2024-05-13)"}
!6 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !7, producer: "clang LLVM (rustc version 1.80.0-nightly (ab14f944a 2024-05-13))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !8, globals: !661, splitDebugInlining: false, nameTableKind: None)
!7 = !DIFile(filename: "agents/gitlab/observe/src/entrypoint.rs/@/21hiitqy3r04wa0jt865224b9", directory: "/home/djshepard/Documents/projects/polar/src")
!8 = !{!9, !20, !28, !74, !131, !142, !155, !163, !176, !181, !187, !211, !219, !245, !251, !256, !261, !271, !277, !284, !291, !300, !308, !315, !323, !329, !337, !475, !510, !519, !525, !534, !543, !550, !553, !621, !625, !630, !636, !643, !650}
!9 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ChannelState", scope: !11, file: !10, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !14)
!10 = !DIFile(filename: "<unknown>", directory: "")

!600 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!601 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!602 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!603 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!604 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!605 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!606 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!607 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!608 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!609 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!610 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!611 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!612 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!613 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!614 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!615 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!616 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!617 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!618 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!619 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!620 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!621 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TryRecvTimeoutError", scope: !551, file: !10, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !622)
!622 = !{!529, !623, !624}
!623 = !DIEnumerator(name: "Timeout", value: 1, isUnsigned: true)
!624 = !DIEnumerator(name: "Disconnected", value: 2, isUnsigned: true)
!625 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TryCurrentErrorKind", scope: !626, file: !10, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !627)
!626 = !DINamespace(name: "handle", scope: !311)
!627 = !{!628, !629}
!628 = !DIEnumerator(name: "NoContext", value: 0, isUnsigned: true)
!629 = !DIEnumerator(name: "ThreadLocalDestroyed", value: 1, isUnsigned: true)
!630 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !631, file: !10, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !632)
!631 = !DINamespace(name: "panicking", scope: !157)
!632 = !{!633, !634, !635}
!633 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!634 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!635 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "PollFuture", scope: !637, file: !10, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !639)
!637 = !DINamespace(name: "harness", scope: !638)
!638 = !DINamespace(name: "task", scope: !311)
!639 = !{!640, !641, !549, !642}
!640 = !DIEnumerator(name: "Complete", value: 0, isUnsigned: true)
!641 = !DIEnumerator(name: "Notified", value: 1, isUnsigned: true)
!642 = !DIEnumerator(name: "Dealloc", value: 3, isUnsigned: true)
!643 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "TransitionToIdle", scope: !644, file: !10, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !645)
!644 = !DINamespace(name: "state", scope: !638)
!645 = !{!646, !647, !648, !649}
!646 = !DIEnumerator(name: "Ok", value: 0, isUnsigned: true)
!647 = !DIEnumerator(name: "OkNotified", value: 1, isUnsigned: true)
!648 = !DIEnumerator(name: "OkDealloc", value: 2, isUnsigned: true)
!649 = !DIEnumerator(name: "Cancelled", value: 3, isUnsigned: true)
!650 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Weekday", scope: !651, file: !10, baseType: !13, size: 8, align: 8, flags: DIFlagEnumClass, elements: !653)
!651 = !DINamespace(name: "weekday", scope: !652)
!652 = !DINamespace(name: "chrono", scope: null)
!653 = !{!654, !655, !656, !657, !658, !659, !660}
!654 = !DIEnumerator(name: "Mon", value: 0, isUnsigned: true)
!655 = !DIEnumerator(name: "Tue", value: 1, isUnsigned: true)
!656 = !DIEnumerator(name: "Wed", value: 2, isUnsigned: true)
!657 = !DIEnumerator(name: "Thu", value: 3, isUnsigned: true)
!658 = !DIEnumerator(name: "Fri", value: 4, isUnsigned: true)
!659 = !DIEnumerator(name: "Sat", value: 5, isUnsigned: true)
!660 = !DIEnumerator(name: "Sun", value: 6, isUnsigned: true)
!661 = !{!662, !1028, !1036, !1049, !1061, !1191, !1206, !1245, !1568, !1578, !1588, !1596, !1615, !1623, !1661, !1830, !1841, !1871, !1879, !1888, !1991, !1999, !2007, !2041, !2050, !2059, !2068, !2077, !2086, !2095, !2104, !2113, !2122, !2131, !2145, !7429, !7437, !7446, !7455, !7614, !7627, !7640}
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "<lapin::error::Error as core::error::Error>::{vtable}", scope: null, file: !10, type: !664, isLocal: true, isDefinition: true)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<lapin::error::Error as core::error::Error>::{vtable_type}", file: !10, size: 704, align: 64, flags: DIFlagArtificial, elements: !665, vtableHolder: !680, templateParams: !687, identifier: "7b02d2f25916e0f566b42651237b6ea0")
!665 = !{!666, !669, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !664, file: !10, baseType: !667, size: 64, align: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !668, size: 64, align: 64, dwarfAddressSpace: 0)
!668 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !664, file: !10, baseType: !670, size: 64, align: 64, offset: 64)
!670 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !664, file: !10, baseType: !670, size: 64, align: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !664, file: !10, baseType: !667, size: 64, align: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !664, file: !10, baseType: !667, size: 64, align: 64, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr5", scope: !664, file: !10, baseType: !667, size: 64, align: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !664, file: !10, baseType: !667, size: 64, align: 64, offset: 384)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !664, file: !10, baseType: !667, size: 64, align: 64, offset: 448)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !664, file: !10, baseType: !667, size: 64, align: 64, offset: 512)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !664, file: !10, baseType: !667, size: 64, align: 64, offset: 576)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !664, file: !10, baseType: !667, size: 64, align: 64, offset: 640)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !681, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !682, templateParams: !687, identifier: "3c708ead1adae3a4295c3d796907890f")
!681 = !DINamespace(name: "error", scope: !12)
!682 = !{!683}
!683 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !680, file: !10, size: 448, align: 64, elements: !684, templateParams: !687, identifier: "d223626e5fef891f3221a035a58419f", discriminator: !1027)
!684 = !{!685, !688, !699, !704, !708, !712, !816, !924, !974, !1025}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ChannelsLimitReached", scope: !683, file: !10, baseType: !686, size: 448, align: 64, extraData: i128 3)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChannelsLimitReached", scope: !680, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !687, identifier: "41b7818be3cb32b5a96da664ba3152d4")
!687 = !{}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidProtocolVersion", scope: !683, file: !10, baseType: !689, size: 448, align: 64, extraData: i128 4)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidProtocolVersion", scope: !680, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !690, templateParams: !687, identifier: "39a5bd79db097b7183186220d1ce3599")
!690 = !{!691}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !689, file: !10, baseType: !692, size: 24, align: 8, offset: 64, flags: DIFlagPublic)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ProtocolVersion", scope: !693, file: !10, size: 24, align: 8, flags: DIFlagPublic, elements: !695, templateParams: !687, identifier: "5f329b47ec33a678b59d19f9062eb9c7")
!693 = !DINamespace(name: "structs", scope: !694)
!694 = !DINamespace(name: "frame", scope: !133)
!695 = !{!696, !697, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !692, file: !10, baseType: !13, size: 8, align: 8, flags: DIFlagPublic)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !692, file: !10, baseType: !13, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !692, file: !10, baseType: !13, size: 8, align: 8, offset: 16, flags: DIFlagPublic)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidChannel", scope: !683, file: !10, baseType: !700, size: 448, align: 64, extraData: i128 5)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidChannel", scope: !680, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !701, templateParams: !687, identifier: "67d71355f19aac0f68693e2410967632")
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !700, file: !10, baseType: !703, size: 16, align: 16, offset: 64, flags: DIFlagPublic)
!703 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidChannelState", scope: !683, file: !10, baseType: !705, size: 448, align: 64, extraData: i128 6)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidChannelState", scope: !680, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !706, templateParams: !687, identifier: "a26099fd9f95507786bc6613c07d8e6e")
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !705, file: !10, baseType: !9, size: 8, align: 8, offset: 64, flags: DIFlagPublic)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidConnectionState", scope: !683, file: !10, baseType: !709, size: 448, align: 64, extraData: i128 7)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidConnectionState", scope: !680, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !710, templateParams: !687, identifier: "f28ef61dccd1289428ef5364f5df6c91")
!710 = !{!711}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !709, file: !10, baseType: !20, size: 8, align: 8, offset: 64, flags: DIFlagPublic)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "IOError", scope: !683, file: !10, baseType: !713, size: 448, align: 64, extraData: i128 8)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IOError", scope: !680, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !714, templateParams: !687, identifier: "d0f51224abfbb12e3b7b49a2b2daa2ae")
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !713, file: !10, baseType: !716, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::io::error::Error, alloc::alloc::Global>", scope: !717, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !719, templateParams: !814, identifier: "9878d8612141d1642665599d6358d949")
!717 = !DINamespace(name: "sync", scope: !718)
!718 = !DINamespace(name: "alloc", scope: null)
!719 = !{!720, !809, !811}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !716, file: !10, baseType: !721, size: 64, align: 64, flags: DIFlagPrivate)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::io::error::Error>>", scope: !722, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !723, templateParams: !807, identifier: "6a2b3c23ccd43f27bf7fe5f302088af6")
!722 = !DINamespace(name: "non_null", scope: !555)
!723 = !{!724}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !721, file: !10, baseType: !725, size: 64, align: 64, flags: DIFlagPrivate)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::io::error::Error>", baseType: !726, size: 64, align: 64, dwarfAddressSpace: 0)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::io::error::Error>", scope: !717, file: !10, size: 192, align: 64, flags: DIFlagPrivate, elements: !727, templateParams: !805, identifier: "c92b4a9ef06cae34bc2c964541adeb1e")
!727 = !{!728, !738, !739}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !726, file: !10, baseType: !729, size: 64, align: 64, flags: DIFlagPrivate)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !511, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !730, templateParams: !687, identifier: "14eb8ed2d09bb4e1ada72b289fc13d3d")
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !729, file: !10, baseType: !732, size: 64, align: 64, flags: DIFlagPrivate)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !733, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !734, templateParams: !736, identifier: "62e87eb3c806b42a53d7ad256134d3a6")
!733 = !DINamespace(name: "cell", scope: !157)
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !732, file: !10, baseType: !670, size: 64, align: 64, flags: DIFlagPrivate)
!736 = !{!737}
!737 = !DITemplateTypeParameter(name: "T", type: !670)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !726, file: !10, baseType: !729, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !726, file: !10, baseType: !740, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !29, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !741, templateParams: !687, identifier: "52bba20a4b7ed2594710885ee17c99a3")
!741 = !{!742}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !740, file: !10, baseType: !743, size: 64, align: 64, flags: DIFlagPrivate)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !744, file: !10, size: 64, align: 64, flags: DIFlagProtected, elements: !745, templateParams: !687, identifier: "10d3f80896611719ead9abf97e32458d")
!744 = !DINamespace(name: "repr_bitpacked", scope: !29)
!745 = !{!746, !752}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !743, file: !10, baseType: !747, size: 64, align: 64, flags: DIFlagPrivate)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !722, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !748, templateParams: !750, identifier: "cad326145ee9c6b15d79f583b1c16ddb")
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !747, file: !10, baseType: !667, size: 64, align: 64, flags: DIFlagPrivate)
!750 = !{!751}
!751 = !DITemplateTypeParameter(name: "T", type: !668)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !743, file: !10, baseType: !753, align: 8, offset: 64, flags: DIFlagPrivate)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !754, file: !10, align: 8, flags: DIFlagPublic, elements: !687, templateParams: !755, identifier: "d0541d61003a38314d21aff095c12d0b")
!754 = !DINamespace(name: "marker", scope: !157)
!755 = !{!756}
!756 = !DITemplateTypeParameter(name: "T", type: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !29, file: !10, size: 128, align: 64, flags: DIFlagPrivate, elements: !758, templateParams: !687, identifier: "ce50a8d2987475e760b33b13244199b")
!758 = !{!759}
!759 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !757, file: !10, size: 128, align: 64, elements: !760, templateParams: !687, identifier: "ef00e9f5e2b789172ab6ae3e5dd7f7e5", discriminator: !804)
!760 = !{!761, !782, !786, !800}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !759, file: !10, baseType: !762, size: 128, align: 64, extraData: i128 0)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !757, file: !10, size: 128, align: 64, flags: DIFlagPrivate, elements: !763, templateParams: !765, identifier: "d8069131c7a80dff66bee5435e11ef51")
!763 = !{!764}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !762, file: !10, baseType: !341, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!765 = !{!766}
!766 = !DITemplateTypeParameter(name: "C", type: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !768, size: 64, align: 64, dwarfAddressSpace: 0)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !29, file: !10, size: 192, align: 64, flags: DIFlagPrivate, elements: !769, templateParams: !687, identifier: "7a8bfa5f52f4933de6c45115312dc594")
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !768, file: !10, baseType: !28, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !768, file: !10, baseType: !772, size: 128, align: 64, flags: DIFlagPrivate)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !10, size: 128, align: 64, elements: !773, templateParams: !687, identifier: "467cf124ef66c0834b340b4ad2c41116")
!773 = !{!774, !777}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !772, file: !10, baseType: !775, size: 64, align: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64, align: 64, dwarfAddressSpace: 0)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !10, align: 8, elements: !687, identifier: "2451719321237d077bd34794dab4fefb")
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !772, file: !10, baseType: !778, size: 64, align: 64, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !779, size: 64, align: 64, dwarfAddressSpace: 0)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 192, align: 64, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 3, lowerBound: 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !759, file: !10, baseType: !783, size: 128, align: 64, extraData: i128 1)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !757, file: !10, size: 128, align: 64, flags: DIFlagPrivate, elements: !784, templateParams: !765, identifier: "4defda6a270f520ec3c32696035ae187")
!784 = !{!785}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !783, file: !10, baseType: !28, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !759, file: !10, baseType: !787, size: 128, align: 64, extraData: i128 2)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !757, file: !10, size: 128, align: 64, flags: DIFlagPrivate, elements: !788, templateParams: !765, identifier: "9b59e817dbd47036ff10b9d93f04fb85")
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !787, file: !10, baseType: !790, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !791, size: 64, align: 64, dwarfAddressSpace: 0)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !29, file: !10, size: 192, align: 64, flags: DIFlagProtected, elements: !792, templateParams: !687, identifier: "326435cdd9e93a70aa9267dc103980db")
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !791, file: !10, baseType: !28, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !791, file: !10, baseType: !795, size: 128, align: 64, flags: DIFlagPrivate)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !10, size: 128, align: 64, elements: !796, templateParams: !687, identifier: "9277eecd40495f85161460476aacc992")
!796 = !{!797, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !795, file: !10, baseType: !798, size: 64, align: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !795, file: !10, baseType: !670, size: 64, align: 64, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !759, file: !10, baseType: !801, size: 128, align: 64, extraData: i128 3)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !757, file: !10, size: 128, align: 64, flags: DIFlagPrivate, elements: !802, templateParams: !765, identifier: "c4ca619a180eb9bd5c9b17a4eabd4095")
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !801, file: !10, baseType: !767, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!804 = !DIDerivedType(tag: DW_TAG_member, scope: !757, file: !10, baseType: !13, size: 8, align: 8, flags: DIFlagArtificial)
!805 = !{!806}
!806 = !DITemplateTypeParameter(name: "T", type: !740)
!807 = !{!808}
!808 = !DITemplateTypeParameter(name: "T", type: !726)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !716, file: !10, baseType: !810, align: 8, offset: 64, flags: DIFlagPrivate)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::io::error::Error>>", scope: !754, file: !10, align: 8, flags: DIFlagPublic, elements: !687, templateParams: !807, identifier: "c0bde2bc05e89d6029fdb5311c38a3d8")
!811 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !716, file: !10, baseType: !812, align: 8, offset: 64, flags: DIFlagPrivate)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !813, file: !10, align: 8, flags: DIFlagPublic, elements: !687, identifier: "45ab977eceff652b67f4e8932f5b6385")
!813 = !DINamespace(name: "alloc", scope: !718)
!814 = !{!806, !815}
!815 = !DITemplateTypeParameter(name: "A", type: !812)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "ParsingError", scope: !683, file: !10, baseType: !817, size: 448, align: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParsingError", scope: !680, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !818, templateParams: !687, identifier: "f94da5b55dfa7acfa3a5484c327654e4")
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !817, file: !10, baseType: !820, size: 448, align: 64, flags: DIFlagPublic)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Err<amq_protocol_types::parsing::ParserErrors>", scope: !821, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !822, templateParams: !687, identifier: "e7e58f314d512a3edaef35aaf61dfedf")
!821 = !DINamespace(name: "internal", scope: !76)
!822 = !{!823}
!823 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !820, file: !10, size: 448, align: 64, elements: !824, templateParams: !687, identifier: "c5f86da9c813df117929d91fe0522f0f", discriminator: !923)
!824 = !{!825, !915, !919}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "Incomplete", scope: !823, file: !10, baseType: !826, size: 448, align: 64, extraData: i128 0)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Incomplete", scope: !820, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !827, templateParams: !848, identifier: "4d8ce5530bc79105c915b0c94fa80d17")
!827 = !{!828}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !826, file: !10, baseType: !829, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Needed", scope: !821, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !830, templateParams: !687, identifier: "3293755ec57d59927925a57fb2e24e2")
!830 = !{!831}
!831 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !829, file: !10, size: 64, align: 64, elements: !832, templateParams: !687, identifier: "d27d4c100765469136c5df078b23a396", discriminator: !847)
!832 = !{!833, !835}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "Unknown", scope: !831, file: !10, baseType: !834, size: 64, align: 64, extraData: i128 0)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unknown", scope: !829, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !687, identifier: "84bdad99059eb1c07b8bd5cea2698046")
!835 = !DIDerivedType(tag: DW_TAG_member, name: "Size", scope: !831, file: !10, baseType: !836, size: 64, align: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Size", scope: !829, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !837, templateParams: !687, identifier: "96a40927f4585504d140866b43c8cce8")
!837 = !{!838}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !836, file: !10, baseType: !839, size: 64, align: 64, flags: DIFlagPublic)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonZero<usize>", scope: !840, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !841, templateParams: !736, identifier: "f9feffb71402320c414319aa9574d48e")
!840 = !DINamespace(name: "nonzero", scope: !527)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !839, file: !10, baseType: !843, size: 64, align: 64, flags: DIFlagPrivate)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroUsizeInner", scope: !844, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !845, templateParams: !687, identifier: "b22d0dd0ad639b7ea7e1d33ffbcedbeb")
!844 = !DINamespace(name: "private", scope: !840)
!845 = !{!846}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !843, file: !10, baseType: !670, size: 64, align: 64, flags: DIFlagPrivate)
!847 = !DIDerivedType(tag: DW_TAG_member, scope: !829, file: !10, baseType: !294, size: 64, align: 64, flags: DIFlagArtificial)
!848 = !{!849}
!849 = !DITemplateTypeParameter(name: "E", type: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ParserErrors", scope: !851, file: !10, size: 384, align: 64, flags: DIFlagPublic, elements: !853, templateParams: !687, identifier: "ddaa392fdd55af12a3a21be2385d07b1")
!851 = !DINamespace(name: "parsing", scope: !852)
!852 = !DINamespace(name: "amq_protocol_types", scope: null)
!853 = !{!854, !873}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !850, file: !10, baseType: !855, size: 192, align: 64, offset: 192, flags: DIFlagPrivate)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VerboseErrorKind", scope: !75, file: !10, size: 192, align: 64, flags: DIFlagPublic, elements: !856, templateParams: !687, identifier: "9fcf3ac7c7bbd65b6b63ab1f5caf2a36")
!856 = !{!857}
!857 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !855, file: !10, size: 192, align: 64, elements: !858, templateParams: !687, identifier: "5942bf69de28934b4eecc5c5e52dd7", discriminator: !872)
!858 = !{!859, !863, !868}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "Context", scope: !857, file: !10, baseType: !860, size: 192, align: 64, extraData: i128 0)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Context", scope: !855, file: !10, size: 192, align: 64, flags: DIFlagPublic, elements: !861, templateParams: !687, identifier: "ed18992eeeb8eeb2536944336c2421c6")
!861 = !{!862}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !860, file: !10, baseType: !795, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Char", scope: !857, file: !10, baseType: !864, size: 192, align: 64, extraData: i128 1)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Char", scope: !855, file: !10, size: 192, align: 64, flags: DIFlagPublic, elements: !865, templateParams: !687, identifier: "15c7749eedad6bb838dcdf307197e4bc")
!865 = !{!866}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !864, file: !10, baseType: !867, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!867 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Nom", scope: !857, file: !10, baseType: !869, size: 192, align: 64, extraData: i128 2)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Nom", scope: !855, file: !10, size: 192, align: 64, flags: DIFlagPublic, elements: !870, templateParams: !687, identifier: "48c5a644528bf8ece08facf62f2fe19f")
!870 = !{!871}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !869, file: !10, baseType: !74, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!872 = !DIDerivedType(tag: DW_TAG_member, scope: !855, file: !10, baseType: !13, size: 8, align: 8, flags: DIFlagArtificial)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "errors", scope: !850, file: !10, baseType: !874, size: 192, align: 64, flags: DIFlagPrivate)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::vec::Vec<nom::error::VerboseErrorKind, alloc::alloc::Global>>", scope: !875, file: !10, size: 192, align: 64, flags: DIFlagPublic, elements: !876, templateParams: !687, identifier: "b5ad4ab2ef4db98685fd8b3f5709ebd5")
!875 = !DINamespace(name: "option", scope: !157)
!876 = !{!877}
!877 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !874, file: !10, size: 192, align: 64, elements: !878, templateParams: !687, identifier: "8e8d070863b3930f5c5e06ee4a0f6fb5", discriminator: !914)
!878 = !{!879, !910}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !877, file: !10, baseType: !880, size: 192, align: 64, extraData: i128 9223372036854775808)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !874, file: !10, size: 192, align: 64, flags: DIFlagPublic, elements: !687, templateParams: !881, identifier: "f8e0991844ada9ad6a871d13b884eda")
!881 = !{!882}
!882 = !DITemplateTypeParameter(name: "T", type: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<nom::error::VerboseErrorKind, alloc::alloc::Global>", scope: !884, file: !10, size: 192, align: 64, flags: DIFlagPublic, elements: !885, templateParams: !908, identifier: "b5df52d4d9892db6815f3443ffe36065")
!884 = !DINamespace(name: "vec", scope: !718)
!885 = !{!886, !909}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !883, file: !10, baseType: !887, size: 128, align: 64, flags: DIFlagPrivate)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<nom::error::VerboseErrorKind, alloc::alloc::Global>", scope: !888, file: !10, size: 128, align: 64, flags: DIFlagProtected, elements: !889, templateParams: !908, identifier: "3fbdab4d99ec127374ab77c509595716")
!888 = !DINamespace(name: "raw_vec", scope: !718)
!889 = !{!890, !903, !907}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !887, file: !10, baseType: !891, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<nom::error::VerboseErrorKind>", scope: !892, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !893, templateParams: !899, identifier: "e4cf6b34b5b5b851d7f05047f77ab5c")
!892 = !DINamespace(name: "unique", scope: !555)
!893 = !{!894, !901}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !891, file: !10, baseType: !895, size: 64, align: 64, flags: DIFlagPrivate)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<nom::error::VerboseErrorKind>", scope: !722, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !896, templateParams: !899, identifier: "5ea8392a1c2f99faa19fda1a3456dc67")
!896 = !{!897}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !895, file: !10, baseType: !898, size: 64, align: 64, flags: DIFlagPrivate)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const nom::error::VerboseErrorKind", baseType: !855, size: 64, align: 64, dwarfAddressSpace: 0)
!899 = !{!900}
!900 = !DITemplateTypeParameter(name: "T", type: !855)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !891, file: !10, baseType: !902, align: 8, offset: 64, flags: DIFlagPrivate)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<nom::error::VerboseErrorKind>", scope: !754, file: !10, align: 8, flags: DIFlagPublic, elements: !687, templateParams: !899, identifier: "da62f219645861ea7df0c3d0e107a4d9")
!903 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !887, file: !10, baseType: !904, size: 64, align: 64, flags: DIFlagPrivate)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !888, file: !10, size: 64, align: 64, flags: DIFlagPrivate, elements: !905, templateParams: !687, identifier: "d1e472ed70ed54683c79961b9f95995b")
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !904, file: !10, baseType: !670, size: 64, align: 64, flags: DIFlagPrivate)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !887, file: !10, baseType: !812, align: 8, offset: 128, flags: DIFlagPrivate)
!908 = !{!900, !815}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !883, file: !10, baseType: !670, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !877, file: !10, baseType: !911, size: 192, align: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !874, file: !10, size: 192, align: 64, flags: DIFlagPublic, elements: !912, templateParams: !881, identifier: "ca736bbd1bb9ae16928dc74698285065")
!912 = !{!913}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !911, file: !10, baseType: !883, size: 192, align: 64, flags: DIFlagPublic)
!914 = !DIDerivedType(tag: DW_TAG_member, scope: !874, file: !10, baseType: !294, size: 64, align: 64, flags: DIFlagArtificial)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "Error", scope: !823, file: !10, baseType: !916, size: 448, align: 64, extraData: i128 1)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !820, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !917, templateParams: !848, identifier: "42e38efc03d840d287197be8937087c7")
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !916, file: !10, baseType: !850, size: 384, align: 64, offset: 64, flags: DIFlagPublic)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "Failure", scope: !823, file: !10, baseType: !920, size: 448, align: 64, extraData: i128 2)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Failure", scope: !820, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !921, templateParams: !848, identifier: "22343616a966acfedf44ef3806bdaafe")
!921 = !{!922}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !920, file: !10, baseType: !850, size: 384, align: 64, offset: 64, flags: DIFlagPublic)
!923 = !DIDerivedType(tag: DW_TAG_member, scope: !820, file: !10, baseType: !294, size: 64, align: 64, flags: DIFlagArtificial)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ProtocolError", scope: !683, file: !10, baseType: !925, size: 448, align: 64, extraData: i128 10)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ProtocolError", scope: !680, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !926, templateParams: !687, identifier: "112a4848e4c239485f2c1e082b4a6af2")
!926 = !{!927}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !925, file: !10, baseType: !928, size: 256, align: 64, offset: 64, flags: DIFlagPublic)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AMQPError", scope: !132, file: !10, size: 256, align: 64, flags: DIFlagPublic, elements: !929, templateParams: !687, identifier: "e3b46b8a1fbf7b58379a22caae1c1c3e")
!929 = !{!930, !944}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !928, file: !10, baseType: !931, size: 16, align: 8, offset: 192, flags: DIFlagPrivate)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AMQPErrorKind", scope: !132, file: !10, size: 16, align: 8, flags: DIFlagPublic, elements: !932, templateParams: !687, identifier: "547129acd8154ff84745004bc3b81665")
!932 = !{!933}
!933 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !931, file: !10, size: 16, align: 8, elements: !934, templateParams: !687, identifier: "c5f44cbc9f47790d76d9d045129e4b28", discriminator: !943)
!934 = !{!935, !939}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "Soft", scope: !933, file: !10, baseType: !936, size: 16, align: 8, extraData: i128 0)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Soft", scope: !931, file: !10, size: 16, align: 8, flags: DIFlagPublic, elements: !937, templateParams: !687, identifier: "538bfc937c1a02fb81ffcd7ba1d75c2")
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !936, file: !10, baseType: !131, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "Hard", scope: !933, file: !10, baseType: !940, size: 16, align: 8, extraData: i128 1)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Hard", scope: !931, file: !10, size: 16, align: 8, flags: DIFlagPublic, elements: !941, templateParams: !687, identifier: "97a1d93288553d8dd96e21e7fc0be175")
!941 = !{!942}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !940, file: !10, baseType: !142, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!943 = !DIDerivedType(tag: DW_TAG_member, scope: !931, file: !10, baseType: !13, size: 8, align: 8, flags: DIFlagArtificial)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !928, file: !10, baseType: !945, size: 192, align: 64, flags: DIFlagPrivate)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShortString", scope: !946, file: !10, size: 192, align: 64, flags: DIFlagPublic, elements: !947, templateParams: !687, identifier: "f05da84e16af8c7bd497e5dfab7bc94a")
!946 = !DINamespace(name: "types", scope: !852)
!947 = !{!948}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !945, file: !10, baseType: !949, size: 192, align: 64, flags: DIFlagPrivate)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !950, file: !10, size: 192, align: 64, flags: DIFlagPublic, elements: !951, templateParams: !687, identifier: "5bd4ce76f19d5a6657c39c76fb43464e")
!950 = !DINamespace(name: "string", scope: !718)
!951 = !{!952}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !949, file: !10, baseType: !953, size: 192, align: 64, flags: DIFlagPrivate)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !884, file: !10, size: 192, align: 64, flags: DIFlagPublic, elements: !954, templateParams: !972, identifier: "ef78336e77121f51b8603d66a2e1dde")
!954 = !{!955, !973}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !953, file: !10, baseType: !956, size: 128, align: 64, flags: DIFlagPrivate)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !888, file: !10, size: 128, align: 64, flags: DIFlagProtected, elements: !957, templateParams: !972, identifier: "b412ffaf8d61173beadbf0f68ec021f3")
!957 = !{!958, !970, !971}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !956, file: !10, baseType: !959, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !892, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !960, templateParams: !966, identifier: "7f4863d5f3ad8418c3cc2599989d5520")
!960 = !{!961, !968}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !959, file: !10, baseType: !962, size: 64, align: 64, flags: DIFlagPrivate)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !722, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !963, templateParams: !966, identifier: "9074788b4c39b3be4004561fd7264a07")
!963 = !{!964}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !962, file: !10, baseType: !965, size: 64, align: 64, flags: DIFlagPrivate)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !13, size: 64, align: 64, dwarfAddressSpace: 0)
!966 = !{!967}
!967 = !DITemplateTypeParameter(name: "T", type: !13)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !959, file: !10, baseType: !969, align: 8, offset: 64, flags: DIFlagPrivate)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !754, file: !10, align: 8, flags: DIFlagPublic, elements: !687, templateParams: !966, identifier: "a6e7bb1c9704027cd996e735b86827f")
!970 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !956, file: !10, baseType: !904, size: 64, align: 64, flags: DIFlagPrivate)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !956, file: !10, baseType: !812, align: 8, offset: 128, flags: DIFlagPrivate)
!972 = !{!967, !815}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !953, file: !10, baseType: !670, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "SerialisationError", scope: !683, file: !10, baseType: !975, size: 448, align: 64, extraData: i128 11)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SerialisationError", scope: !680, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !976, templateParams: !687, identifier: "f4b75d631098325fc264893bcf13a8e2")
!976 = !{!977}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !975, file: !10, baseType: !978, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<cookie_factory::internal::GenError, alloc::alloc::Global>", scope: !717, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !979, templateParams: !1024, identifier: "e51551e0ea095c2cc8526f5f4634ea48")
!979 = !{!980, !1021, !1023}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !978, file: !10, baseType: !981, size: 64, align: 64, flags: DIFlagPrivate)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<cookie_factory::internal::GenError>>", scope: !722, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !982, templateParams: !1019, identifier: "833430be4f0117759ee4abcdec64b5fb")
!982 = !{!983}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !981, file: !10, baseType: !984, size: 64, align: 64, flags: DIFlagPrivate)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<cookie_factory::internal::GenError>", baseType: !985, size: 64, align: 64, dwarfAddressSpace: 0)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<cookie_factory::internal::GenError>", scope: !717, file: !10, size: 256, align: 64, flags: DIFlagPrivate, elements: !986, templateParams: !1017, identifier: "a3690ee417ddcabb864b110236aa5cb1")
!986 = !{!987, !988, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !985, file: !10, baseType: !729, size: 64, align: 64, flags: DIFlagPrivate)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !985, file: !10, baseType: !729, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !985, file: !10, baseType: !990, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GenError", scope: !991, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !993, templateParams: !687, identifier: "71d1c373f2ba1125f24c1edcc6d02f30")
!991 = !DINamespace(name: "internal", scope: !992)
!992 = !DINamespace(name: "cookie_factory", scope: null)
!993 = !{!994}
!994 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !990, file: !10, size: 128, align: 64, elements: !995, templateParams: !687, identifier: "e7a8b05e772414e6d826181df4206eb", discriminator: !1016)
!995 = !{!996, !1000, !1004, !1006, !1010, !1014}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "BufferTooSmall", scope: !994, file: !10, baseType: !997, size: 128, align: 64, extraData: i128 0)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BufferTooSmall", scope: !990, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !998, templateParams: !687, identifier: "2ff2318db9dfdcf552b5f4dc1453ec73")
!998 = !{!999}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !997, file: !10, baseType: !670, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "BufferTooBig", scope: !994, file: !10, baseType: !1001, size: 128, align: 64, extraData: i128 1)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BufferTooBig", scope: !990, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1002, templateParams: !687, identifier: "d02a220479dcf3de7d22228eff62ab6b")
!1002 = !{!1003}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1001, file: !10, baseType: !670, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidOffset", scope: !994, file: !10, baseType: !1005, size: 128, align: 64, extraData: i128 2)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidOffset", scope: !990, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !687, identifier: "b82915c3535ecb2388a73bdea53183a9")
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "IoError", scope: !994, file: !10, baseType: !1007, size: 128, align: 64, extraData: i128 3)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IoError", scope: !990, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1008, templateParams: !687, identifier: "13eda35ac605b15c5c13b8fb9d696fc7")
!1008 = !{!1009}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1007, file: !10, baseType: !740, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "CustomError", scope: !994, file: !10, baseType: !1011, size: 128, align: 64, extraData: i128 4)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CustomError", scope: !990, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1012, templateParams: !687, identifier: "6d5c9c93f3db2543795af439222140a3")
!1012 = !{!1013}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1011, file: !10, baseType: !166, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "NotYetImplemented", scope: !994, file: !10, baseType: !1015, size: 128, align: 64, extraData: i128 5)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NotYetImplemented", scope: !990, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !687, identifier: "93c59c99b67ce3ad59a0401731c3b62e")
!1016 = !DIDerivedType(tag: DW_TAG_member, scope: !990, file: !10, baseType: !166, size: 32, align: 32, flags: DIFlagArtificial)
!1017 = !{!1018}
!1018 = !DITemplateTypeParameter(name: "T", type: !990)
!1019 = !{!1020}
!1020 = !DITemplateTypeParameter(name: "T", type: !985)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !978, file: !10, baseType: !1022, align: 8, offset: 64, flags: DIFlagPrivate)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<cookie_factory::internal::GenError>>", scope: !754, file: !10, align: 8, flags: DIFlagPublic, elements: !687, templateParams: !1019, identifier: "9666e2746470c3b5fcca05ee81be02b")
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !978, file: !10, baseType: !812, align: 8, offset: 64, flags: DIFlagPrivate)
!1024 = !{!1018, !815}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "MissingHeartbeatError", scope: !683, file: !10, baseType: !1026, size: 448, align: 64, extraData: i128 12)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MissingHeartbeatError", scope: !680, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !687, identifier: "8ca34e10ad8011fac3da43ab59dd0bda")
!1027 = !DIDerivedType(tag: DW_TAG_member, scope: !680, file: !10, baseType: !294, size: 64, align: 64, flags: DIFlagArtificial)
!1028 = !DIGlobalVariableExpression(var: !1029, expr: !DIExpression())
!1029 = distinct !DIGlobalVariable(name: "<&str as serde::de::Expected>::{vtable}", scope: null, file: !10, type: !1030, isLocal: true, isDefinition: true)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as serde::de::Expected>::{vtable_type}", file: !10, size: 256, align: 64, flags: DIFlagArtificial, elements: !1031, vtableHolder: !795, templateParams: !687, identifier: "ac2ad49b9439857ff29500ba0f85e6b6")
!1031 = !{!1032, !1033, !1034, !1035}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !1030, file: !10, baseType: !667, size: 64, align: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1030, file: !10, baseType: !670, size: 64, align: 64, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1030, file: !10, baseType: !670, size: 64, align: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !1030, file: !10, baseType: !667, size: 64, align: 64, offset: 192)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "<serde_yaml::value::de::{impl#0}::deserialize::ValueVisitor as serde::de::Expected>::{vtable}", scope: null, file: !10, type: !1038, isLocal: true, isDefinition: true)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<serde_yaml::value::de::{impl#0}::deserialize::ValueVisitor as serde::de::Expected>::{vtable_type}", file: !10, size: 256, align: 64, flags: DIFlagArtificial, elements: !1039, vtableHolder: !1044, templateParams: !687, identifier: "5224b82fd534645c702ee7eb786890c3")
!1039 = !{!1040, !1041, !1042, !1043}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !1038, file: !10, baseType: !667, size: 64, align: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1038, file: !10, baseType: !670, size: 64, align: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1038, file: !10, baseType: !670, size: 64, align: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !1038, file: !10, baseType: !667, size: 64, align: 64, offset: 192)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ValueVisitor", scope: !1045, file: !10, align: 8, flags: DIFlagProtected, elements: !687, identifier: "806ef88f93afb34a36bbbc8364f41638")
!1045 = !DINamespace(name: "deserialize", scope: !1046)
!1046 = !DINamespace(name: "{impl#0}", scope: !1047)
!1047 = !DINamespace(name: "de", scope: !1048)
!1048 = !DINamespace(name: "value", scope: !264)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "<serde::de::impls::StringVisitor as serde::de::Expected>::{vtable}", scope: null, file: !10, type: !1051, isLocal: true, isDefinition: true)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<serde::de::impls::StringVisitor as serde::de::Expected>::{vtable_type}", file: !10, size: 256, align: 64, flags: DIFlagArtificial, elements: !1052, vtableHolder: !1057, templateParams: !687, identifier: "1c6402e158219eb3412c6c13d1ea8980")
!1052 = !{!1053, !1054, !1055, !1056}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !1051, file: !10, baseType: !667, size: 64, align: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1051, file: !10, baseType: !670, size: 64, align: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1051, file: !10, baseType: !670, size: 64, align: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !1051, file: !10, baseType: !667, size: 64, align: 64, offset: 192)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "StringVisitor", scope: !1058, file: !10, align: 8, flags: DIFlagPrivate, elements: !687, identifier: "55950cefeab564a463c0588e2976efae")
!1058 = !DINamespace(name: "impls", scope: !1059)
!1059 = !DINamespace(name: "de", scope: !1060)
!1060 = !DINamespace(name: "serde", scope: null)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(name: "<core::fmt::Arguments as tracing_core::field::Value>::{vtable}", scope: null, file: !10, type: !1063, isLocal: true, isDefinition: true)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Arguments as tracing_core::field::Value>::{vtable_type}", file: !10, size: 256, align: 64, flags: DIFlagArtificial, elements: !1064, vtableHolder: !1069, templateParams: !687, identifier: "bafe72e248c5cc20a6f80af499556711")
!1064 = !{!1065, !1066, !1067, !1068}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !1063, file: !10, baseType: !667, size: 64, align: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1063, file: !10, baseType: !670, size: 64, align: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1063, file: !10, baseType: !670, size: 64, align: 64, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !1063, file: !10, baseType: !667, size: 64, align: 64, offset: 192)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !331, file: !10, size: 384, align: 64, flags: DIFlagPublic, elements: !1070, templateParams: !687, identifier: "ed927188972d3e83eeff0e361fed3918")
!1070 = !{!1071, !1077, !1119}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !1069, file: !10, baseType: !1072, size: 128, align: 64, flags: DIFlagPrivate)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !10, size: 128, align: 64, elements: !1073, templateParams: !687, identifier: "4e66b00a376d6af5b8765440fb2839f")
!1073 = !{!1074, !1076}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !1072, file: !10, baseType: !1075, size: 64, align: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64, align: 64, dwarfAddressSpace: 0)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1072, file: !10, baseType: !670, size: 64, align: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !1069, file: !10, baseType: !1078, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !875, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1079, templateParams: !687, identifier: "6ef7cd0a4dba13126c34673e10d6d839")
!1079 = !{!1080}
!1080 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !1078, file: !10, size: 128, align: 64, elements: !1081, templateParams: !687, identifier: "73a0b171333b74ce55997334f8321449", discriminator: !1118)
!1081 = !{!1082, !1114}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !1080, file: !10, baseType: !1083, size: 128, align: 64, extraData: i128 0)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !1078, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !687, templateParams: !1084, identifier: "14cfb02e6fbc61f555ce6670df8c515d")
!1084 = !{!1085}
!1085 = !DITemplateTypeParameter(name: "T", type: !1086)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !10, size: 128, align: 64, elements: !1087, templateParams: !687, identifier: "5cfdfeb8a4334e2856b9053a73656887")
!1087 = !{!1088, !1113}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !1086, file: !10, baseType: !1089, size: 64, align: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64, align: 64, dwarfAddressSpace: 0)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !330, file: !10, size: 448, align: 64, flags: DIFlagPublic, elements: !1091, templateParams: !687, identifier: "1e956a11041d5751a480c0491a72f38e")
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1112}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !1090, file: !10, baseType: !670, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !1090, file: !10, baseType: !867, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1090, file: !10, baseType: !329, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1090, file: !10, baseType: !166, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1090, file: !10, baseType: !1097, size: 128, align: 64, flags: DIFlagPublic)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !330, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1098, templateParams: !687, identifier: "801dcbc08df127055018d298824c3448")
!1098 = !{!1099}
!1099 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !1097, file: !10, size: 128, align: 64, elements: !1100, templateParams: !687, identifier: "45876a93fc9a3714b15b7f9ef41744a3", discriminator: !1111)
!1100 = !{!1101, !1105, !1109}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !1099, file: !10, baseType: !1102, size: 128, align: 64, extraData: i128 0)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !1097, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1103, templateParams: !687, identifier: "bffd13f5f2ba1341ee9d1a983959985b")
!1103 = !{!1104}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1102, file: !10, baseType: !670, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !1099, file: !10, baseType: !1106, size: 128, align: 64, extraData: i128 1)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !1097, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1107, templateParams: !687, identifier: "9f187b518911e41da16bcae13594367")
!1107 = !{!1108}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1106, file: !10, baseType: !670, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !1099, file: !10, baseType: !1110, size: 128, align: 64, extraData: i128 2)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !1097, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !687, identifier: "6d505565ae95ecc7d71b912eb660e4f3")
!1111 = !DIDerivedType(tag: DW_TAG_member, scope: !1097, file: !10, baseType: !294, size: 64, align: 64, flags: DIFlagArtificial)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1090, file: !10, baseType: !1097, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1086, file: !10, baseType: !670, size: 64, align: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !1080, file: !10, baseType: !1115, size: 128, align: 64)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !1078, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1116, templateParams: !1084, identifier: "2ce5da5ed5d04ac5c8f24712385ba4fd")
!1116 = !{!1117}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1115, file: !10, baseType: !1086, size: 128, align: 64, flags: DIFlagPublic)
!1118 = !DIDerivedType(tag: DW_TAG_member, scope: !1078, file: !10, baseType: !294, size: 64, align: 64, flags: DIFlagArtificial)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1069, file: !10, baseType: !1120, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !10, size: 128, align: 64, elements: !1121, templateParams: !687, identifier: "7946d785354023a072fb3b63acebbb66")
!1121 = !{!1122, !1190}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !1120, file: !10, baseType: !1123, size: 64, align: 64)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64, align: 64, dwarfAddressSpace: 0)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !330, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1125, templateParams: !687, identifier: "735f65526df0234a16130d1f7ba73c")
!1125 = !{!1126}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !1124, file: !10, baseType: !1127, size: 128, align: 64, flags: DIFlagPrivate)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !330, file: !10, size: 128, align: 64, flags: DIFlagPrivate, elements: !1128, templateParams: !687, identifier: "6aee9ec8c6a46d3b5167728358399112")
!1128 = !{!1129}
!1129 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !1127, file: !10, size: 128, align: 64, elements: !1130, templateParams: !687, identifier: "b0b790b8fe36db2212ab32a29bf14217", discriminator: !1189)
!1130 = !{!1131, !1185}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !1129, file: !10, baseType: !1132, size: 128, align: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !1127, file: !10, size: 128, align: 64, flags: DIFlagPrivate, elements: !1133, templateParams: !687, identifier: "7b74ae7544c1d3b1debf430a26b424fc")
!1133 = !{!1134, !1138}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1132, file: !10, baseType: !1135, size: 64, align: 64, flags: DIFlagPrivate)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !1136, size: 64, align: 64, dwarfAddressSpace: 0)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !1137, file: !10, align: 8, elements: !687, identifier: "51703081c45f0c637cb49c263a08edff")
!1137 = !DINamespace(name: "{extern#0}", scope: !330)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !1132, file: !10, baseType: !1139, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !1140, size: 64, align: 64, dwarfAddressSpace: 0)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{!1142, !1135, !1159}
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !1143, file: !10, size: 8, align: 8, flags: DIFlagPublic, elements: !1144, templateParams: !687, identifier: "312532e094310f5513e2852d65033020")
!1143 = !DINamespace(name: "result", scope: !157)
!1144 = !{!1145}
!1145 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !1142, file: !10, size: 8, align: 8, elements: !1146, templateParams: !687, identifier: "a5b36bb0c8e05b85626d2a5655db41ff", discriminator: !1158)
!1146 = !{!1147, !1154}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !1145, file: !10, baseType: !1148, size: 8, align: 8, extraData: i128 0)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !1142, file: !10, size: 8, align: 8, flags: DIFlagPublic, elements: !1149, templateParams: !1151, identifier: "a72dc343a638ca89f15c66784090fb7")
!1149 = !{!1150}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1148, file: !10, baseType: !668, align: 8, offset: 8, flags: DIFlagPublic)
!1151 = !{!751, !1152}
!1152 = !DITemplateTypeParameter(name: "E", type: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !331, file: !10, align: 8, flags: DIFlagPublic, elements: !687, identifier: "cf511546bb231a84abc932a83cbe1dc6")
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !1145, file: !10, baseType: !1155, size: 8, align: 8, extraData: i128 1)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !1142, file: !10, size: 8, align: 8, flags: DIFlagPublic, elements: !1156, templateParams: !1151, identifier: "c597e501890522045bac27cf06f53c29")
!1156 = !{!1157}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1155, file: !10, baseType: !1153, align: 8, offset: 8, flags: DIFlagPublic)
!1158 = !DIDerivedType(tag: DW_TAG_member, scope: !1142, file: !10, baseType: !13, size: 8, align: 8, flags: DIFlagArtificial)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !1160, size: 64, align: 64, dwarfAddressSpace: 0)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !331, file: !10, size: 512, align: 64, flags: DIFlagPublic, elements: !1161, templateParams: !687, identifier: "9aec3c99add6549077cc329678a62858")
!1161 = !{!1162, !1163, !1164, !1165, !1177, !1178}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1160, file: !10, baseType: !166, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !1160, file: !10, baseType: !867, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1160, file: !10, baseType: !329, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !1160, file: !10, baseType: !1166, size: 128, align: 64, flags: DIFlagPrivate)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !875, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1167, templateParams: !687, identifier: "79c0398523eb714d4ca607b369faba1")
!1167 = !{!1168}
!1168 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !1166, file: !10, size: 128, align: 64, elements: !1169, templateParams: !687, identifier: "465ec013bddfe424d48fce276a21f682", discriminator: !1176)
!1169 = !{!1170, !1172}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !1168, file: !10, baseType: !1171, size: 128, align: 64, extraData: i128 0)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !1166, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !687, templateParams: !736, identifier: "bdbc5c0d7110e9c13fa1f5028f14899a")
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !1168, file: !10, baseType: !1173, size: 128, align: 64, extraData: i128 1)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !1166, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1174, templateParams: !736, identifier: "99c769090e94097077b18cf3e139598f")
!1174 = !{!1175}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1173, file: !10, baseType: !670, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!1176 = !DIDerivedType(tag: DW_TAG_member, scope: !1166, file: !10, baseType: !294, size: 64, align: 64, flags: DIFlagArtificial)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1160, file: !10, baseType: !1166, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1160, file: !10, baseType: !1179, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !10, size: 128, align: 64, elements: !1180, templateParams: !687, identifier: "81904566391a817ac15038f5983922f")
!1180 = !{!1181, !1184}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1179, file: !10, baseType: !1182, size: 64, align: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64, align: 64, dwarfAddressSpace: 0)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !10, align: 8, elements: !687, identifier: "39286d724a8946ac1b3a81019e1baa19")
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1179, file: !10, baseType: !778, size: 64, align: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !1129, file: !10, baseType: !1186, size: 128, align: 64, extraData: i128 0)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !1127, file: !10, size: 128, align: 64, flags: DIFlagPrivate, elements: !1187, templateParams: !687, identifier: "24d6addfcb397d27aabc9f1edbb10379")
!1187 = !{!1188}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1186, file: !10, baseType: !670, size: 64, align: 64, flags: DIFlagPrivate)
!1189 = !DIDerivedType(tag: DW_TAG_member, scope: !1127, file: !10, baseType: !294, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1120, file: !10, baseType: !670, size: 64, align: 64, offset: 64)
!1191 = !DIGlobalVariableExpression(var: !1192, expr: !DIExpression())
!1192 = distinct !DIGlobalVariable(name: "<tracing_core::field::DisplayValue<&alloc::string::String> as tracing_core::field::Value>::{vtable}", scope: null, file: !10, type: !1193, isLocal: true, isDefinition: true)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<tracing_core::field::DisplayValue<&alloc::string::String> as tracing_core::field::Value>::{vtable_type}", file: !10, size: 256, align: 64, flags: DIFlagArtificial, elements: !1194, vtableHolder: !1199, templateParams: !687, identifier: "503f11b77f41c475f56865f88fa2602c")
!1194 = !{!1195, !1196, !1197, !1198}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !1193, file: !10, baseType: !667, size: 64, align: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1193, file: !10, baseType: !670, size: 64, align: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1193, file: !10, baseType: !670, size: 64, align: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !1193, file: !10, baseType: !667, size: 64, align: 64, offset: 192)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DisplayValue<&alloc::string::String>", scope: !1200, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !1201, templateParams: !1204, identifier: "33c7a63934e0771dbf660bae0244fbd1")
!1200 = !DINamespace(name: "field", scope: !293)
!1201 = !{!1202}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1199, file: !10, baseType: !1203, size: 64, align: 64, flags: DIFlagPrivate)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::string::String", baseType: !949, size: 64, align: 64, dwarfAddressSpace: 0)
!1204 = !{!1205}
!1205 = !DITemplateTypeParameter(name: "T", type: !1203)
!1206 = !DIGlobalVariableExpression(var: !1207, expr: !DIExpression())
!1207 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<core::result::Result<(), alloc::boxed::Box<dyn core::error::Error, alloc::alloc::Global>>> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !10, type: !1208, isLocal: true, isDefinition: true)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<core::result::Result<(), alloc::boxed::Box<dyn core::error::Error, alloc::alloc::Global>>> as core::ops::function::Fn<()>>::{vtable_type}", file: !10, size: 384, align: 64, flags: DIFlagArtificial, elements: !1209, vtableHolder: !1216, templateParams: !687, identifier: "b52c2179f26aa57419a010ee41554d27")
!1209 = !{!1210, !1211, !1212, !1213, !1214, !1215}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !1208, file: !10, baseType: !667, size: 64, align: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1208, file: !10, baseType: !670, size: 64, align: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1208, file: !10, baseType: !670, size: 64, align: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !1208, file: !10, baseType: !667, size: 64, align: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !1208, file: !10, baseType: !667, size: 64, align: 64, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !1208, file: !10, baseType: !667, size: 64, align: 64, offset: 320)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::result::Result<(), alloc::boxed::Box<dyn core::error::Error, alloc::alloc::Global>>>", scope: !1217, file: !10, size: 64, align: 64, elements: !1219, templateParams: !687, identifier: "bede1ad433a880de1f1344d7d51c0075")
!1217 = !DINamespace(name: "lang_start", scope: !1218)
!1218 = !DINamespace(name: "rt", scope: !31)
!1219 = !{!1220}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !1216, file: !10, baseType: !1221, size: 64, align: 64)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn() -> core::result::Result<(), alloc::boxed::Box<dyn core::error::Error, alloc::alloc::Global>>", baseType: !1222, size: 64, align: 64, dwarfAddressSpace: 0)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!1224}
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), alloc::boxed::Box<dyn core::error::Error, alloc::alloc::Global>>", scope: !1143, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1225, templateParams: !687, identifier: "ac895f8f137ca6d865c771187713564b")
!1225 = !{!1226}
!1226 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !1224, file: !10, size: 128, align: 64, elements: !1227, templateParams: !687, identifier: "9c12dd6ecda8a189880c83a51459c54", discriminator: !1244)
!1227 = !{!1228, !1240}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !1226, file: !10, baseType: !1229, size: 128, align: 64, extraData: i128 0)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !1224, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1230, templateParams: !1232, identifier: "f049bf2abdafba7815f401824b1ee8ff")
!1230 = !{!1231}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1229, file: !10, baseType: !668, align: 8, flags: DIFlagPublic)
!1232 = !{!751, !1233}
!1233 = !DITemplateTypeParameter(name: "E", type: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<dyn core::error::Error, alloc::alloc::Global>", file: !10, size: 128, align: 64, elements: !1235, templateParams: !687, identifier: "331f9d7211a07065fe738d349403089")
!1235 = !{!1236, !1239}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1234, file: !10, baseType: !1237, size: 64, align: 64)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64, align: 64, dwarfAddressSpace: 0)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::error::Error", file: !10, align: 8, elements: !687, identifier: "fe214943d4ff1641342bc487aea8f2f7")
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1234, file: !10, baseType: !778, size: 64, align: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !1226, file: !10, baseType: !1241, size: 128, align: 64)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !1224, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1242, templateParams: !1232, identifier: "f45e8da079abf062d071b897c6ca4de0")
!1242 = !{!1243}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1241, file: !10, baseType: !1234, size: 128, align: 64, flags: DIFlagPublic)
!1244 = !DIDerivedType(tag: DW_TAG_member, scope: !1224, file: !10, baseType: !294, size: 64, align: 64, flags: DIFlagArtificial)
!1245 = !DIGlobalVariableExpression(var: !1246, expr: !DIExpression())
!1246 = distinct !DIGlobalVariable(name: "<std::thread::{impl#0}::spawn_unchecked_::{closure_env#2}<ctrlc::set_handler_inner::{closure_env#0}<observer_entrypoint::main::{async_block#0}::{closure_env#0}>, ()> as core::ops::function::FnOnce<()>>::{vtable}", scope: null, file: !10, type: !1247, isLocal: true, isDefinition: true)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<std::thread::{impl#0}::spawn_unchecked_::{closure_env#2}<ctrlc::set_handler_inner::{closure_env#0}<observer_entrypoint::main::{async_block#0}::{closure_env#0}>, ()> as core::ops::function::FnOnce<()>>::{vtable_type}", file: !10, size: 256, align: 64, flags: DIFlagArtificial, elements: !1248, vtableHolder: !1253, templateParams: !687, identifier: "283f3ba82b0521719d19acde31c2898d")
!1248 = !{!1249, !1250, !1251, !1252}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !1247, file: !10, baseType: !667, size: 64, align: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1247, file: !10, baseType: !670, size: 64, align: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1247, file: !10, baseType: !670, size: 64, align: 64, offset: 128)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !1247, file: !10, baseType: !667, size: 64, align: 64, offset: 192)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#2}<ctrlc::set_handler_inner::{closure_env#0}<observer_entrypoint::main::{async_block#0}::{closure_env#0}>, ()>", scope: !1254, file: !10, size: 256, align: 64, elements: !1257, templateParams: !687, identifier: "6f31cecd83f83e28a88d86f55a21ecc6")
!1254 = !DINamespace(name: "spawn_unchecked_", scope: !1255)
!1255 = !DINamespace(name: "{impl#0}", scope: !1256)
!1256 = !DINamespace(name: "thread", scope: !31)
!1257 = !{!1258, !1340, !1400, !1447}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "their_thread", scope: !1253, file: !10, baseType: !1259, size: 64, align: 64)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !1256, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !1260, templateParams: !687, identifier: "7c7b4b4b1380ec7e189bfcd75633c7da")
!1260 = !{!1261}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1259, file: !10, baseType: !1262, size: 64, align: 64, flags: DIFlagPrivate)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pin<alloc::sync::Arc<std::thread::Inner, alloc::alloc::Global>>", scope: !1263, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !1264, templateParams: !1338, identifier: "c5558464e7ad9d1cf4b45bf26f9c35a5")
!1263 = !DINamespace(name: "pin", scope: !157)
!1264 = !{!1265}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "__pointer", scope: !1262, file: !10, baseType: !1266, size: 64, align: 64, flags: DIFlagPublic)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Inner, alloc::alloc::Global>", scope: !717, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !1267, templateParams: !1337, identifier: "4ca7c02025c5cb01c88744b78a30c78")
!1267 = !{!1268, !1334, !1336}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1266, file: !10, baseType: !1269, size: 64, align: 64, flags: DIFlagPrivate)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Inner>>", scope: !722, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !1270, templateParams: !1332, identifier: "c6747ab0b9809122366222be8afb44a1")
!1270 = !{!1271}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1269, file: !10, baseType: !1272, size: 64, align: 64, flags: DIFlagPrivate)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Inner>", baseType: !1273, size: 64, align: 64, dwarfAddressSpace: 0)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Inner>", scope: !717, file: !10, size: 448, align: 64, flags: DIFlagPrivate, elements: !1274, templateParams: !1330, identifier: "ed3b17dc325f4d5b28d6a3cf1787061")
!1274 = !{!1275, !1276, !1277}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !1273, file: !10, baseType: !729, size: 64, align: 64, flags: DIFlagPrivate)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !1273, file: !10, baseType: !729, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1273, file: !10, baseType: !1278, size: 320, align: 64, offset: 128, flags: DIFlagPrivate)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !1256, file: !10, size: 320, align: 64, flags: DIFlagPrivate, elements: !1279, templateParams: !687, identifier: "db39af1f6704f05e8cbd271d166d735")
!1279 = !{!1280, !1303, !1315}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1278, file: !10, baseType: !1281, size: 192, align: 64, flags: DIFlagPrivate)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadName", scope: !1256, file: !10, size: 192, align: 64, flags: DIFlagPrivate, elements: !1282, templateParams: !687, identifier: "a3a5ff7c5898f8dd8625a7b813a37ce8")
!1282 = !{!1283}
!1283 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !1281, file: !10, size: 192, align: 64, elements: !1284, templateParams: !687, identifier: "161b7741e4d3c34d65799076563ccc89", discriminator: !1302)
!1284 = !{!1285, !1287, !1300}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "Main", scope: !1283, file: !10, baseType: !1286, size: 192, align: 64, extraData: i128 0)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", scope: !1281, file: !10, size: 192, align: 64, flags: DIFlagPrivate, elements: !687, identifier: "28cd21957a20bf0531a0d9fc055b5b32")
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "Other", scope: !1283, file: !10, baseType: !1288, size: 192, align: 64, extraData: i128 1)
!1288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Other", scope: !1281, file: !10, size: 192, align: 64, flags: DIFlagPrivate, elements: !1289, templateParams: !687, identifier: "dd6ec94833373b98a8f576f3b9e5c148")
!1289 = !{!1290}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1288, file: !10, baseType: !1291, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !1292, file: !10, size: 128, align: 64, flags: DIFlagPublic, elements: !1294, templateParams: !687, identifier: "59175969da85d61c49c46313b0033595")
!1292 = !DINamespace(name: "c_str", scope: !1293)
!1293 = !DINamespace(name: "ffi", scope: !718)
!1294 = !{!1295}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1291, file: !10, baseType: !1296, size: 128, align: 64, flags: DIFlagPrivate)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !10, size: 128, align: 64, elements: !1297, templateParams: !687, identifier: "e99f0c0ba4bc784e252d1370120dfaea")
!1297 = !{!1298, !1299}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !1296, file: !10, baseType: !798, size: 64, align: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1296, file: !10, baseType: !670, size: 64, align: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "Unnamed", scope: !1283, file: !10, baseType: !1301, size: 192, align: 64, extraData: i128 2)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unnamed", scope: !1281, file: !10, size: 192, align: 64, flags: DIFlagPrivate, elements: !687, identifier: "d203205c0927cddbfee734960650b216")
!1302 = !DIDerivedType(tag: DW_TAG_member, scope: !1281, file: !10, baseType: !294, size: 64, align: 64, flags: DIFlagArtificial)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1278, file: !10, baseType: !1304, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadId", scope: !1256, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !1305, templateParams: !687, identifier: "10193dc6e4012699cf5a3077b3053dae")
!1305 = !{!1306}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1304, file: !10, baseType: !1307, size: 64, align: 64, flags: DIFlagPrivate)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonZero<u64>", scope: !840, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !1308, templateParams: !1313, identifier: "cebbd5a7183a43c4059d737167fb38d")
!1308 = !{!1309}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1307, file: !10, baseType: !1310, size: 64, align: 64, flags: DIFlagPrivate)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64Inner", scope: !844, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !1311, templateParams: !687, identifier: "a59473bab772c9793ecac2ec3fa7e5fd")
!1311 = !{!1312}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1310, file: !10, baseType: !294, size: 64, align: 64, flags: DIFlagPrivate)
!1313 = !{!1314}
!1314 = !DITemplateTypeParameter(name: "T", type: !294)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !1278, file: !10, baseType: !1316, size: 32, align: 32, offset: 256, flags: DIFlagPrivate)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !1317, file: !10, size: 32, align: 32, flags: DIFlagPublic, elements: !1320, templateParams: !687, identifier: "5a2be9ffb89b85df10374984162253a0")
!1317 = !DINamespace(name: "futex", scope: !1318)
!1318 = !DINamespace(name: "thread_parking", scope: !1319)
!1319 = !DINamespace(name: "sync", scope: !318)
!1320 = !{!1321}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1316, file: !10, baseType: !1322, size: 32, align: 32, flags: DIFlagPrivate)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !511, file: !10, size: 32, align: 32, flags: DIFlagPublic, elements: !1323, templateParams: !687, identifier: "b8bbc388055a7563512420056e358e90")
!1323 = !{!1324}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1322, file: !10, baseType: !1325, size: 32, align: 32, flags: DIFlagPrivate)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !733, file: !10, size: 32, align: 32, flags: DIFlagPublic, elements: !1326, templateParams: !1328, identifier: "bb9453badc53560bde303aa6e2b9c90")
!1326 = !{!1327}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1325, file: !10, baseType: !166, size: 32, align: 32, flags: DIFlagPrivate)
!1328 = !{!1329}
!1329 = !DITemplateTypeParameter(name: "T", type: !166)
!1330 = !{!1331}
!1331 = !DITemplateTypeParameter(name: "T", type: !1278)
!1332 = !{!1333}
!1333 = !DITemplateTypeParameter(name: "T", type: !1273)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !1266, file: !10, baseType: !1335, align: 8, offset: 64, flags: DIFlagPrivate)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Inner>>", scope: !754, file: !10, align: 8, flags: DIFlagPublic, elements: !687, templateParams: !1332, identifier: "adea2064653826c0d6325ef3421975e6")
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1266, file: !10, baseType: !812, align: 8, offset: 64, flags: DIFlagPrivate)
!1337 = !{!1331, !815}
!1338 = !{!1339}
!1339 = !DITemplateTypeParameter(name: "Ptr", type: !1266)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "output_capture", scope: !1253, file: !10, baseType: !1341, size: 64, align: 64, offset: 128)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>, alloc::alloc::Global>>", scope: !875, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !1342, templateParams: !687, identifier: "11d9d640e9d272ecb14acb579d83974")
!1342 = !{!1343}
!1343 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !1341, file: !10, size: 64, align: 64, elements: !1344, templateParams: !687, identifier: "c51e310d6beacc15f06436cd62589624", discriminator: !1399)
!1344 = !{!1345, !1395}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !1343, file: !10, baseType: !1346, size: 64, align: 64, extraData: i128 0)
!1346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !1341, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !687, templateParams: !1347, identifier: "4f9708685c178c28df07b2840fcd640e")
!1347 = !{!1348}
!1348 = !DITemplateTypeParameter(name: "T", type: !1349)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>, alloc::alloc::Global>", scope: !717, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !1350, templateParams: !1394, identifier: "47273661f5e840a7b66616c1c69140d5")
!1350 = !{!1351, !1391, !1393}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !1349, file: !10, baseType: !1352, size: 64, align: 64, flags: DIFlagPrivate)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !722, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !1353, templateParams: !1389, identifier: "e0d07da53b0a4481369ad318ccea06e0")
!1353 = !{!1354}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1352, file: !10, baseType: !1355, size: 64, align: 64, flags: DIFlagPrivate)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", baseType: !1356, size: 64, align: 64, dwarfAddressSpace: 0)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>", scope: !717, file: !10, size: 384, align: 64, flags: DIFlagPrivate, elements: !1357, templateParams: !1387, identifier: "97a3930b128380eabe5c39b59f930c66")
!1357 = !{!1358, !1359, !1360}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !1356, file: !10, baseType: !729, size: 64, align: 64, flags: DIFlagPrivate)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !1356, file: !10, baseType: !729, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1356, file: !10, baseType: !1361, size: 256, align: 64, offset: 128, flags: DIFlagPrivate)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !1362, file: !10, size: 256, align: 64, flags: DIFlagPublic, elements: !1363, templateParams: !1385, identifier: "316d264fd25b0507f0f1434ae21f0aff")
!1362 = !DINamespace(name: "mutex", scope: !521)
!1363 = !{!1364, !1370, !1381}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1361, file: !10, baseType: !1365, size: 32, align: 32, flags: DIFlagPrivate)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !1366, file: !10, size: 32, align: 32, flags: DIFlagPublic, elements: !1368, templateParams: !687, identifier: "e2bd42293def1ecfbce411cc101bee98")
!1366 = !DINamespace(name: "futex", scope: !1367)
!1367 = !DINamespace(name: "mutex", scope: !1319)
!1368 = !{!1369}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "futex", scope: !1365, file: !10, baseType: !1322, size: 32, align: 32, flags: DIFlagPrivate)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !1361, file: !10, baseType: !1371, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !1372, file: !10, size: 8, align: 8, flags: DIFlagPublic, elements: !1373, templateParams: !687, identifier: "c7b577fbd74895f5eed065bfac239ad6")
!1372 = !DINamespace(name: "poison", scope: !521)
!1373 = !{!1374}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !1371, file: !10, baseType: !1375, size: 8, align: 8, flags: DIFlagPrivate)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !511, file: !10, size: 8, align: 8, flags: DIFlagPublic, elements: !1376, templateParams: !687, identifier: "356a96037b0d58816fbdaf061debcdde")
!1376 = !{!1377}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !1375, file: !10, baseType: !1378, size: 8, align: 8, flags: DIFlagPrivate)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !733, file: !10, size: 8, align: 8, flags: DIFlagPublic, elements: !1379, templateParams: !966, identifier: "bb4fe87f2d7daa2ce7346c6d099eb710")
!1379 = !{!1380}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1378, file: !10, baseType: !13, size: 8, align: 8, flags: DIFlagPrivate)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1361, file: !10, baseType: !1382, size: 192, align: 64, offset: 64, flags: DIFlagPrivate)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<u8, alloc::alloc::Global>>", scope: !733, file: !10, size: 192, align: 64, flags: DIFlagPublic, elements: !1383, templateParams: !1385, identifier: "735b585ea37b3132ae7730ff9a445a71")
!1383 = !{!1384}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1382, file: !10, baseType: !953, size: 192, align: 64, flags: DIFlagPrivate)
!1385 = !{!1386}
!1386 = !DITemplateTypeParameter(name: "T", type: !953)
!1387 = !{!1388}
!1388 = !DITemplateTypeParameter(name: "T", type: !1361)
!1389 = !{!1390}
!1390 = !DITemplateTypeParameter(name: "T", type: !1356)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !1349, file: !10, baseType: !1392, align: 8, offset: 64, flags: DIFlagPrivate)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8, alloc::alloc::Global>>>>", scope: !754, file: !10, align: 8, flags: DIFlagPublic, elements: !687, templateParams: !1389, identifier: "be11e04d7d3dbc82f3f55c42d4353ebe")
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1349, file: !10, baseType: !812, align: 8, offset: 64, flags: DIFlagPrivate)
!1394 = !{!1388, !815}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !1343, file: !10, baseType: !1396, size: 64, align: 64)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !1341, file: !10, size: 64, align: 64, flags: DIFlagPublic, elements: !1397, templateParams: !1347, identifier: "bffbdb4a987d928cdcf44f7191bf592c")
!1397 = !{!1398}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !1396, file: !10, baseType: !1349, size: 64, align: 64, flags: DIFlagPublic)
!1399 = !DIDerivedType(tag: DW_TAG_member, scope: !1341, file: !10, baseType: !294, size: 64, align: 64, flags: DIFlagArtificial)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1253, file: !10, baseType: !1401, size: 64, align: 64, offset: 192)
